using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace DZ_1_1
{
    class Zadanie_5
    {
        public static void DZ_Five()
        {
            ////а) Написать программу, которая выводит на экран ваше имя, фамилию и город проживания.
            ////б) *Сделать задание, только вывод организовать в центре экрана.

            ////Шурухин Александр Сергеевич
            ////Ввод имени
            //Console.Write("Введите имя: ");
            //string name = Console.ReadLine();
            ////Ввод фамилии
            //Console.Write("Введите фамилию: ");
            //string sec_name = Console.ReadLine();
            ////Ввод возраста
            //Console.Write("Введите город: ");
            //string city = Console.ReadLine();
            //Console.WriteLine(" {0,45} {1,2} из города {2,2}", name, sec_name, city);

        }
    }
}
